from utils import check_msg, compose_and_send_msg
from config import verbose

words_whitelist = [
    'виз',
    'шенген',
    'visa',
    'центр',
    'посольств',
    'консульств',
    'слот',
    'подач',
    'отказ',
    'биометрия',
    'паспорт',
    'загран',
    'анкета',
    'справк',
    'выписк',
    'страховк',
    'бронь',
    'приглашен',
    'апостиль',
    'тур',
    'поездк',
    'путешеств',
    'билет',
    'отель',
    'границ',
    'отпуск',
    'каникул'
]

words_blacklist = [

    "€", "eur", "евро"
    "$",
    "долл",
    "руб",
    "pln", "зл", "zl",
    "халтур",
    "профил",
    "ваканс",
    "награ",
    "крипт",
    "лс",
    "wb",
    "вб"
]

system_prompt = """
Ты - маркетолог, который сидит в групповых чатах для поиска потенциальных клиентов. 
Твоя задача - найти сообщения, на которые можно логично и к месту предложить наши услуги в оформлении виз, документов апостилей и так далее.
Ты должен прочитать сообщение человека и отметить, является ли оно релевантным для этой цели.
Сообщение является релевантным если:
1. Человек явно или неявно просит о помощи в оформлении визы, выезде за границу или поездке в отпуск.
2. Человек описывает свои трудности с документами, имеет отказы по визе или что-то подобное.
3. Человек говорит о скорых каникулах и желании поехать отдохнуть за границу.
4. Если контекст сообщения позволяет ответить, упомянув наши услуши в оформлении виз, однако не притягивай этот контекст слишком сильно.
Если ты сомневаешься, является ли сообщение релевантным для нас, то помечай его релевантным. Нам важно отсеить спам, но ещё важнее не упустить потенциальных клиентов.
Поле reason заполняется кратким описанием причины, по которой сообщения является релевантным или нет.
Релевантность отмечается булевым полем is_relevant.
Вот несколько примеров:
EXAMPLE INPUT:
Есть кто получал шенген визу недавно? Как вы подавались, через агентство?
        
EXAMPLE JSON OUTPUT:
    {"reason": "Человеку изявляет интерес к получению визы", "is_relevant": "True"}

EXAMPLE INPUT:
Здравствуйте):  Подскажите пожалуйста Если у меня визы закончится через 3 месяцев и паспорт через год так что возможно ли я могу подать документы для РВПО ?
        
EXAMPLE JSON OUTPUT:
    {"reason": "Человек задаёт вопросы связанные с документами и визами", "is_relevant": "True"}

EXAMPLE INPUT:
Может есть кто-ниудь готовый перевезти посылку за границу? Заплачу долларами
        
EXAMPLE JSON OUTPUT:
    {"reason": "Человек не является потенциальным клиентом", "is_relevant": "False"}    

EXAMPLE INPUT:
Здравствуйте. Мне необходимо оформить апостиль на справку об успеваемости для иностранных ВУЗов. Есть ли кто это уже делал?
        
EXAMPLE JSON OUTPUT:
    {"reason": "Человеку нужна помощт с документами для поездки за границу", "is_relevant": "True"}

EXAMPLE INPUT:
Мне не нужна виза, у меня есть гражданство Германии
        
EXAMPLE JSON OUTPUT:
    {"reason": "Человек не является потенциальным клиентом", "is_relevant": "False"}
"""


async def check_and_handle_msg_visa(msg_text, chat, event, bot_name, bot_phone, send_chat_id, send_message_func, llm_client, logger):
    is_msg_relevant = False
    is_msg_relevant, reason = check_msg(llm_client, msg_text, words_whitelist, words_blacklist, system_prompt)
        
    if is_msg_relevant:
        await compose_and_send_msg(msg_text, chat, event, bot_name, bot_phone, send_chat_id, send_message_func, logger)
    else:
        if verbose:
            logger.info(f"Found an irrelevant message: {msg_text}")